app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question
    @answers = @question.answers

    if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "answers" ("description", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Nick thinks she's soooooooooooooooooooooooooooooooo hot!!!!!!!"], ["question_id", 9], ["created_at", 2017-01-10 18:46:48 UTC], ["updated_at", 2017-01-10 18:46:48 UTC]]