app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.order(created_at: :desc)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 1]]
---
  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order(created_at: :asc)

INSERT INTO "questions" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "questions" SET "favorite_id" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["favorite_id", 1], ["updated_at", 2017-01-12 19:35:48 UTC], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])
    if params[:question][:favorite]
      @answer = Answer.find(params[:question][:favorite])
      @question.favorite_id = @answer.id
    end

    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 6]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 7]]
---
  def destroy
    @question = Question.find(params[:id])
    @question.answers.each do |answer|
      answer.destroy
    end
    @question.destroy